In [1]:
import pandas as pd

In [2]:
tb1=pd.read_excel(r"C:\Users\Lucky Prem\Downloads\sample_-_superstore.xls", sheet_name="People")

In [3]:
tb1

              Person   Region Sex  Age
0      Anna Andreadi     West   M   33
1        Chuck Magee     East   M   45
2     Kelly Williams  Central   F   33
3  Cassandra Brandow    South   F   55

In [4]:
tb1.index

RangeIndex(start=0, stop=4, step=1)

Index can be string and may be unique

In [5]:
tb1.set_index('Age')

                Person   Region Sex
Age
33       Anna Andreadi     West   M
45         Chuck Magee     East   M
33      Kelly Williams  Central   F
55   Cassandra Brandow    South   F

In [6]:
tb1.set_index('Age', inplace=True)
tb1

                Person   Region Sex
Age
33       Anna Andreadi     West   M
45         Chuck Magee     East   M
33      Kelly Williams  Central   F
55   Cassandra Brandow    South   F

In [7]:
tb1.reset_index()

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F

In [8]:
tb1.reset_index(inplace=True)
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F

In [15]:
#lock[row/index,column/name]
tb1.loc[1,'Person']

'Chuck Magee'

In [30]:
tb1.iloc[1,1]

'Chuck Magee'

In [13]:
tb1.loc[1:3,'Person':'Sex']  #tb1.loc[[1:3],['Person':'Sex']] SyntaxError: invalid syntax

              Person   Region Sex
1        Chuck Magee     East   M
2     Kelly Williams  Central   F
3  Cassandra Brandow    South   F

In [14]:
tb1.loc[[1,3],['Person','Sex']]

              Person Sex
1        Chuck Magee   M
3  Cassandra Brandow   F

In [21]:
#tb1.iloc[1:3,1:3]
tb1.iloc[[1,3],[1,3]]

              Person Sex
1        Chuck Magee   M
3  Cassandra Brandow   F

In [22]:
tb2=tb1.head(3)
tb2

   Age          Person   Region Sex
0   33   Anna Andreadi     West   M
1   45     Chuck Magee     East   M
2   33  Kelly Williams  Central   F

In [23]:
tb2.set_index('Sex', inplace=True)

In [24]:
tb2.loc['M']

     Age         Person Region
Sex
M     33  Anna Andreadi   West
M     45    Chuck Magee   East

In [25]:
tb2.loc['M',['Person','Age']]

            Person  Age
Sex
M    Anna Andreadi   33
M      Chuck Magee   45

In [29]:
tb2.set_index('Age', inplace=True)
tb2

             Person   Region
Age
33    Anna Andreadi     West
45      Chuck Magee     East
33   Kelly Williams  Central

In [30]:
#tb2.iloc[33] #IndexError Traceback (most recent call last)----> 1 tb2.iloc[33]
tb2.loc[33]

             Person   Region
Age
33    Anna Andreadi     West
33   Kelly Williams  Central

In [33]:
tb2.reset_index(inplace=True)
tb2.loc[1]

index               1
Age                45
Person    Chuck Magee
Region           East
Name: 1, dtype: object

In [34]:
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F

In [52]:
pd.crosstab(tb1.Sex, tb1.Age) #comparing two columns

Age  33  45  55
Sex
F     1   0   1
M     1   1   0

In [54]:
#compare more than two columns in context of another column. 
tb1.groupby('Sex').sum()

     Age                           Person        Region
Sex
F     88  Kelly WilliamsCassandra Brandow  CentralSouth
M     78         Anna AndreadiChuck Magee      WestEast

In [62]:
tb1.loc[len(tb1)]=[33,"Cesam Brandow","South","F"]
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F
4   33      Cesam Brandow    South   F

In [61]:
tb1.groupby(['Sex','Region']).sum()

             Age                          Person
Sex Region
F   Central   33                  Kelly Williams
    South     88  Cassandra BrandowCesam Brandow
M   East      45                     Chuck Magee
    West      33                   Anna Andreadi